CSI API ETABS v1
cDStChinese_2018 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStChinese_2018
Public Interface cDStChinese_2018
Dim instance As cDStChinese_2018
public interface class cDStChinese_2018
type cDStChinese_2018 =  interface end
The cDStChinese_2018 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Sets the value of a steel design overwrite item.
GetPreference
 Sets the value of a steel design preference item.
SetOverwrite
 Sets the value of a steel design overwrite item.
SetPreference
 Sets the value of a steel design preference item.
Top
See Also
Reference
ETABSv1 Namespace